#include"Linklist_head.h"
void MainMenu_print()//打印主菜单
{
	printf("————————第一周 链表—————————————————————————————\n");
	printf("1.单链表  2.双链表  0.退出\n");
	printf("—————————————————————————————————————————————————\n");
	printf("请输入功能选项（0-2）:\n");
}

void SingleLinklistMenu_print()//打印单链表功能单
{
	printf("————————单链表功能单—————————————————————————————————————————\n");
	printf("1.打印链表  2.添加数据  3.奇偶调换  4.找链表中点  5.判断链表是否成环  6.反转链表  0.返回主菜单\n");
	printf("—————————————————————————————————————————————————————————————\n");
	printf("请输入功能选项（0-6）:\n");
}

void DoubleLinklist_print()//打印双链表功能单
{
	printf("————————双链表功能单—————————————————————————————\n");
	printf("1.打印链表  2.添加数据  0.退出\n");
	printf("—————————————————————————————————————————————————\n");
	printf("请输入功能选项（0-2）:\n");
}