#include"sort.h"
void MainMenu_print()//´òÓ¡Ö÷²Ëµ¥
{
	printf("¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ªµÚÒ»ÖÜ Á´±í¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª\n");
	printf("1.Éú³ÉÊý¾Ý  2.ÅÅÐò  3.Çå¿ÕÊý¾Ý  0.ÍË³ö\n");
	printf("¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª\n");
	printf("ÇëÊäÈë¹¦ÄÜÑ¡Ïî£¨0-3£©:\n");
}

void Sort_Menu_print()//´òÓ¡ÅÅÐò·½·¨
{
	printf("¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ªµ¥Á´±í¹¦ÄÜµ¥¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª\n");
	printf("1.²åÈëÅÅÐò  2.¹é²¢ÅÅÐò  3.¿ìËÙÅÅÐò  4.¼ÆÊýÅÅÐò  5.»ùÊý¼ÆÊýÅÅÐò   0.·µ»ØÖ÷²Ëµ¥\n");
	printf("¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª\n");
	printf("ÇëÊäÈë0-6Ñ¡ÔñÅÅÐò·½Ê½:\n");
}